app/controllers/api/v1/images_controller.rb

  def index
    respond_with Image.all
---
SELECT "images".* FROM "images"

  def show
    image = Image.find(params["id"])
---
SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]