app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    respond_with User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    user = User.find(params["id"])